extension EmojiList.Classic.PeopleAndBody {
    public enum HandFingersOpen {
        public static let basic: [Character] = [
            "👋", "🤚", "🖐️", "✋", "🖖",
        ]
        
        public static let all: [Character] = [
            "👋", "🤚", "🖐️", "✋", "🖖", "🫱", "🫲", "🫳", "🫴", "🫷", "🫸",
        ]
    }

    public enum HandFingersPartial {
        public static let basic: [Character] = [
            "👌", "✌️", "🤞", "🤟", "🤘", "🤙",
        ]
        
        public static let all: [Character] = [
            "👌", "🤌", "🤏", "✌️", "🤞", "🫰", "🤟", "🤘", "🤙",
        ]
    }

    public enum HandSingleFinger {
        public static let basic: [Character] = [
            "👈", "👉", "👆", "🖕", "👇", "☝️",
        ]
        
        public static let all: [Character] = [
            "👈", "👉", "👆", "🖕", "👇", "☝️", "🫵",
        ]
    }

    public enum HandFingersClosed {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "👍", "👎", "✊", "👊", "🤛", "🤜",
        ]
    }

    public enum Hands {
        public static let basic: [Character] = [
            "👏", "🙌", "👐", "🤲", "🤝", "🙏",
        ]
        
        public static let all: [Character] = [
            "👏", "🙌", "🫶", "👐", "🤲", "🤝", "🙏",
        ]
    }

    public enum HandProp {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "✍️", "💅", "🤳",
        ]
    }

    public enum BodyParts {
        public static let basic: [Character] = [
            "💪", "🦵", "🦶", "👂", "👃", "🧠",
            "🦷", "🦴", "👀", "👁️", "👅", "👄",
        ]
        
        public static let all: [Character] = [
            "💪", "🦾", "🦿", "🦵", "🦶", "👂", "🦻", "👃", "🧠", "🫀",
            "🫁", "🦷", "🦴", "👀", "👁️", "👅", "👄", "🫦",
        ]
    }

    public enum Person {
        public static let basic: [Character] = [
            "👶", "🧒", "👦", "👧", "🧑", "👱", "👨", "🧔",
            "👨‍🦰", "👨‍🦱", "👨‍🦳", "👨‍🦲", "👩", "👩‍🦰", "👩‍🦱", "👩‍🦳",
            "👩‍🦲", "👱‍♀️", "👱‍♂️", "🧓", "👴", "👵",
        ]
        
        public static let all: [Character] = [
            "👶", "🧒", "👦", "👧", "🧑", "👱", "👨", "🧔", "🧔‍♂️", "🧔‍♀️",
            "👨‍🦰", "👨‍🦱", "👨‍🦳", "👨‍🦲", "👩", "👩‍🦰", "🧑‍🦰", "👩‍🦱", "🧑‍🦱", "👩‍🦳",
            "🧑‍🦳", "👩‍🦲", "🧑‍🦲", "👱‍♀️", "👱‍♂️", "🧓", "👴", "👵",
        ]
    }

    public enum PersonGesture {
        public static let basic: [Character] = [
            "🙍", "🙍‍♂️", "🙍‍♀️", "🙎", "🙎‍♂️", "🙎‍♀️", "🙅", "🙅‍♂️", "🙅‍♀️", "🙆",
            "🙆‍♂️", "🙆‍♀️", "💁", "💁‍♂️", "💁‍♀️", "🙋", "🙋‍♂️", "🙋‍♀️",
            "🙇", "🙇‍♂️", "🙇‍♀️", "🤦", "🤦‍♂️", "🤦‍♀️", "🤷", "🤷‍♂️", "🤷‍♀️",

        ]
        
        public static let all: [Character] = [
            "🙍", "🙍‍♂️", "🙍‍♀️", "🙎", "🙎‍♂️", "🙎‍♀️", "🙅", "🙅‍♂️", "🙅‍♀️", "🙆",
            "🙆‍♂️", "🙆‍♀️", "💁", "💁‍♂️", "💁‍♀️", "🙋", "🙋‍♂️", "🙋‍♀️", "🧏", "🧏‍♂️",
            "🧏‍♀️", "🙇", "🙇‍♂️", "🙇‍♀️", "🤦", "🤦‍♂️", "🤦‍♀️", "🤷", "🤷‍♂️", "🤷‍♀️",

        ]
    }

    public enum PersonRole {
        public static let basic: [Character] = [
            "👨‍⚕️", "👩‍⚕️", "👨‍🎓", "👩‍🎓", "👨‍🏫", "👩‍🏫",
            "👨‍⚖️", "👩‍⚖️", "👨‍🌾", "👩‍🌾", "👨‍🍳", "👩‍🍳", "👨‍🔧",
            "👩‍🔧", "👨‍🏭", "👩‍🏭", "👨‍💼", "👩‍💼", "👨‍🔬", "👩‍🔬",
            "👨‍💻", "👩‍💻", "👨‍🎤", "👩‍🎤", "👨‍🎨", "👩‍🎨",
            "👨‍✈️", "👩‍✈️", "👨‍🚀", "👩‍🚀", "👨‍🚒", "👩‍🚒", "👮", "👮‍♂️",
            "👮‍♀️", "🕵️", "🕵️‍♂️", "🕵️‍♀️", "💂", "💂‍♂️", "💂‍♀️", "👷", "👷‍♂️",
            "👷‍♀️", "🤴", "👸", "👳", "👳‍♂️", "👳‍♀️", "👲", "🧕", "🤵",
            "👰", "🤰", "🤱",
        ]
        
        public static let all: [Character] = [
            "🧑‍⚕️", "👨‍⚕️", "👩‍⚕️", "🧑‍🎓", "👨‍🎓", "👩‍🎓", "🧑‍🏫", "👨‍🏫", "👩‍🏫", "🧑‍⚖️",
            "👨‍⚖️", "👩‍⚖️", "🧑‍🌾", "👨‍🌾", "👩‍🌾", "🧑‍🍳", "👨‍🍳", "👩‍🍳", "🧑‍🔧", "👨‍🔧",
            "👩‍🔧", "🧑‍🏭", "👨‍🏭", "👩‍🏭", "🧑‍💼", "👨‍💼", "👩‍💼", "🧑‍🔬", "👨‍🔬", "👩‍🔬",
            "🧑‍💻", "👨‍💻", "👩‍💻", "🧑‍🎤", "👨‍🎤", "👩‍🎤", "🧑‍🎨", "👨‍🎨", "👩‍🎨", "🧑‍✈️",
            "👨‍✈️", "👩‍✈️", "🧑‍🚀", "👨‍🚀", "👩‍🚀", "🧑‍🚒", "👨‍🚒", "👩‍🚒", "👮", "👮‍♂️",
            "👮‍♀️", "🕵️", "🕵️‍♂️", "🕵️‍♀️", "💂", "💂‍♂️", "💂‍♀️", "🥷", "👷", "👷‍♂️",
            "👷‍♀️", "🫅", "🤴", "👸", "👳", "👳‍♂️", "👳‍♀️", "👲", "🧕", "🤵",
            "🤵‍♂️", "🤵‍♀️", "👰", "👰‍♂️", "👰‍♀️", "🤰", "🫃", "🫄", "🤱", "👩‍🍼",
            "👨‍🍼", "🧑‍🍼",
        ]
    }

    public enum PersonFantasy {
        public static let basic: [Character] = [
            "👼", "🎅", "🤶", "🦸", "🦸‍♂️", "🦸‍♀️", "🦹", "🦹‍♂️", "🦹‍♀️",
            "🧙", "🧙‍♂️", "🧙‍♀️", "🧚", "🧚‍♂️", "🧚‍♀️", "🧛", "🧛‍♂️", "🧛‍♀️", "🧜",
            "🧜‍♂️", "🧜‍♀️", "🧝", "🧝‍♂️", "🧝‍♀️", "🧞", "🧞‍♂️", "🧞‍♀️", "🧟", "🧟‍♂️",
            "🧟‍♀️",
        ]
        
        public static let all: [Character] = [
            "👼", "🎅", "🤶", "🧑‍🎄", "🦸", "🦸‍♂️", "🦸‍♀️", "🦹", "🦹‍♂️", "🦹‍♀️",
            "🧙", "🧙‍♂️", "🧙‍♀️", "🧚", "🧚‍♂️", "🧚‍♀️", "🧛", "🧛‍♂️", "🧛‍♀️", "🧜",
            "🧜‍♂️", "🧜‍♀️", "🧝", "🧝‍♂️", "🧝‍♀️", "🧞", "🧞‍♂️", "🧞‍♀️", "🧟", "🧟‍♂️",
            "🧟‍♀️", "🧌",
        ]
    }

    public enum PersonActivity {
        public static let basic: [Character] = [
            "💆", "💆‍♂️", "💆‍♀️", "💇", "💇‍♂️", "💇‍♀️", "🚶", "🚶‍♂️", "🚶‍♀️",
            "🏃",
            "🏃‍♂️", "🏃‍♀️", "💃", "🕺", "🕴️", "👯", "👯‍♂️",
            "👯‍♀️", "🧖", "🧖‍♂️", "🧖‍♀️", "🧗", "🧗‍♂️", "🧗‍♀️",
        ]
        
        public static let all: [Character] = [
            "💆", "💆‍♂️", "💆‍♀️", "💇", "💇‍♂️", "💇‍♀️", "🚶", "🚶‍♂️", "🚶‍♀️", "🚶‍➡️",
            "🚶‍♀️‍➡️", "🚶‍♂️‍➡️", "🧍", "🧍‍♂️", "🧍‍♀️", "🧎", "🧎‍♂️", "🧎‍♀️", "🧎‍➡️", "🧎‍♀️‍➡️",
            "🧎‍♂️‍➡️", "🧑‍🦯", "🧑‍🦯‍➡️", "👨‍🦯", "👨‍🦯‍➡️", "👩‍🦯", "👩‍🦯‍➡️", "🧑‍🦼", "🧑‍🦼‍➡️", "👨‍🦼",
            "👨‍🦼‍➡️", "👩‍🦼", "👩‍🦼‍➡️", "🧑‍🦽", "🧑‍🦽‍➡️", "👨‍🦽", "👨‍🦽‍➡️", "👩‍🦽", "👩‍🦽‍➡️", "🏃",
            "🏃‍♂️", "🏃‍♀️", "🏃‍➡️", "🏃‍♀️‍➡️", "🏃‍♂️‍➡️", "💃", "🕺", "🕴️", "👯", "👯‍♂️",
            "👯‍♀️", "🧖", "🧖‍♂️", "🧖‍♀️", "🧗", "🧗‍♂️", "🧗‍♀️",
        ]
    }

    public enum PersonSport {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🤺", "🏇", "⛷️", "🏂", "🏌️", "🏌️‍♂️", "🏌️‍♀️", "🏄", "🏄‍♂️", "🏄‍♀️",
            "🚣", "🚣‍♂️", "🚣‍♀️", "🏊", "🏊‍♂️", "🏊‍♀️", "⛹️", "⛹️‍♂️", "⛹️‍♀️", "🏋️",
            "🏋️‍♂️", "🏋️‍♀️", "🚴", "🚴‍♂️", "🚴‍♀️", "🚵", "🚵‍♂️", "🚵‍♀️", "🤸", "🤸‍♂️",
            "🤸‍♀️", "🤼", "🤼‍♂️", "🤼‍♀️", "🤽", "🤽‍♂️", "🤽‍♀️", "🤾", "🤾‍♂️", "🤾‍♀️",
            "🤹", "🤹‍♂️", "🤹‍♀️",
        ]
    }

    public enum PersonResting {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🧘", "🧘‍♂️", "🧘‍♀️", "🛀", "🛌",
        ]
    }

    public enum Family {
        public static let basic: [Character] = [
            "👭", "👫", "👬", "💏", "👩‍❤️‍💋‍👨", "💑", "👩‍❤️‍👨", "👨‍👩‍👦", "👨‍👩‍👧",
            "👨‍👩‍👧‍👦", "👨‍👩‍👦‍👦", "👨‍👩‍👧‍👧", "👨‍👦", "👨‍👦‍👦", "👨‍👧", "👨‍👧‍👦", "👨‍👧‍👧", "👩‍👦", "👩‍👦‍👦",
            "👩‍👧", "👩‍👧‍👦", "👩‍👧‍👧",
        ]
        
        public static let all: [Character] = [
            "🧑‍🤝‍🧑", "👭", "👫", "👬", "💏", "👩‍❤️‍💋‍👨", "💑", "👩‍❤️‍👨", "👨‍👩‍👦", "👨‍👩‍👧",
            "👨‍👩‍👧‍👦", "👨‍👩‍👦‍👦", "👨‍👩‍👧‍👧", "👨‍👦", "👨‍👦‍👦", "👨‍👧", "👨‍👧‍👦", "👨‍👧‍👧", "👩‍👦", "👩‍👦‍👦",
            "👩‍👧", "👩‍👧‍👦", "👩‍👧‍👧",
        ]
    }

    public enum PersonSymbol {
        public static let basic: [Character] = [
            "🗣️", "👤", "👥", "👪", "👣",
        ]
        
        public static let all: [Character] = [
            "🗣️", "👤", "👥", "🫂", "👪", "🧑‍🧑‍🧒", "🧑‍🧑‍🧒‍🧒", "🧑‍🧒", "🧑‍🧒‍🧒", "👣", "🫆",
        ]
    }
}
