extension EmojiList.Classic.Flags {
    public enum FoodFruit {
        public static let basic: [Character] = [
            "🍇", "🍈", "🍉", "🍊", "🍋", "🍌", "🍍", "🥭", "🍎",
            "🍏", "🍐", "🍑", "🍒", "🍓", "🥝", "🍅", "🥥",

        ]
        
        public static let all: [Character] = [
            "🍇", "🍈", "🍉", "🍊", "🍋", "🍋‍🟩", "🍌", "🍍", "🥭", "🍎",
            "🍏", "🍐", "🍑", "🍒", "🍓", "🫐", "🥝", "🍅", "🫒", "🥥",

        ]
    }

    public enum FoodVegetable {
        public static let basic: [Character] = [
            "🥑", "🍆", "🥔", "🥕", "🌽", "🌶️", "🥒", "🥬", "🥦",
            "🥜", "🌰",
        ]
        
        public static let all: [Character] = [
            "🥑", "🍆", "🥔", "🥕", "🌽", "🌶️", "🫑", "🥒", "🥬", "🥦",
            "🧄", "🧅", "🥜", "🫘", "🌰", "🫚", "🫛", "🍄‍🟫", "🫜",
        ]
    }

    public enum FoodPrepared {
        public static let basic: [Character] = [
            "🍞", "🥐", "🥖", "🥨", "🥯", "🥞", "🧀", "🍖",
            "🍗", "🥩", "🥓", "🍔", "🍟", "🍕", "🌭", "🥪", "🌮", "🌯",
            "🥙", "🥚", "🍳", "🥘", "🍲", "🥣", "🥗",
            "🍿", "🧂", "🥫",
        ]
        
        public static let all: [Character] = [
            "🍞", "🥐", "🥖", "🫓", "🥨", "🥯", "🥞", "🧇", "🧀", "🍖",
            "🍗", "🥩", "🥓", "🍔", "🍟", "🍕", "🌭", "🥪", "🌮", "🌯",
            "🫔", "🥙", "🧆", "🥚", "🍳", "🥘", "🍲", "🫕", "🥣", "🥗",
            "🍿", "🧈", "🧂", "🥫",
        ]
    }

    public enum FoodAsian {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🍱", "🍘", "🍙", "🍚", "🍛", "🍜", "🍝", "🍠", "🍢", "🍣",
            "🍤", "🍥", "🥮", "🍡", "🥟", "🥠", "🥡",
        ]
    }

    public enum FoodWweet {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🍦", "🍧", "🍨", "🍩", "🍪", "🎂", "🍰", "🧁", "🥧", "🍫",
            "🍬", "🍭", "🍮", "🍯",
        ]
    }

    public enum Drink {
        public static let basic: [Character] = [
            "🍼", "🥛", "☕", "🍵", "🍶", "🍾", "🍷", "🍸", "🍹",
            "🍺", "🍻", "🥂", "🥃", "🥤",

        ]
        
        public static let all: [Character] = [
            "🍼", "🥛", "☕", "🫖", "🍵", "🍶", "🍾", "🍷", "🍸", "🍹",
            "🍺", "🍻", "🥂", "🥃", "🫗", "🥤", "🧋", "🧃", "🧉", "🧊",

        ]
    }

    public enum Dishware {
        public static let basic: [Character] = [
            "🥢", "🍽️", "🍴", "🥄", "🔪", "🏺",
        ]
        
        public static let all: [Character] = [
            "🥢", "🍽️", "🍴", "🥄", "🔪", "🫙", "🏺",
        ]
    }
}
