extension EmojiList.Classic.TravelAndPlaces {
    public enum PlaceMap {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🌍", "🌎", "🌏", "🌐", "🗺️", "🗾", "🧭",
        ]
    }

    public enum PlaceGeographic {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🏔️", "⛰️", "🌋", "🗻", "🏕️", "🏖️", "🏜️", "🏝️", "🏞️",
        ]
    }

    public enum PlaceBuilding {
        public static let basic: [Character] = [
            "🏟️", "🏛️", "🏗️", "🧱", "🏘️", "🏚️", "🏠",
            "🏡", "🏢", "🏣", "🏤", "🏥", "🏦", "🏨", "🏩", "🏪", "🏫",
            "🏬", "🏭", "🏯", "🏰", "💒", "🗼", "🗽",
        ]
        
        public static let all: [Character] = [
            "🏟️", "🏛️", "🏗️", "🧱", "🪨", "🪵", "🛖", "🏘️", "🏚️", "🏠",
            "🏡", "🏢", "🏣", "🏤", "🏥", "🏦", "🏨", "🏩", "🏪", "🏫",
            "🏬", "🏭", "🏯", "🏰", "💒", "🗼", "🗽",
        ]
    }

    public enum PlaceReligious {
        public static let basic: [Character] = [
            "⛪", "🕌", "🕍", "⛩️", "🕋",
        ]
        
        public static let all: [Character] = [
            "⛪", "🕌", "🛕", "🕍", "⛩️", "🕋",
        ]
    }

    public enum PlaceOther {
        public static let basic: [Character] = [
            "⛲", "⛺", "🌁", "🌃", "🏙️", "🌄", "🌅", "🌆", "🌇", "🌉",
            "♨️", "🎠", "🎡", "🎢", "💈", "🎪",
        ]
        
        public static let all: [Character] = [
            "⛲", "⛺", "🌁", "🌃", "🏙️", "🌄", "🌅", "🌆", "🌇", "🌉",
            "♨️", "🎠", "🛝", "🎡", "🎢", "💈", "🎪",
        ]
    }

    public enum TransportGround {
        public static let basic: [Character] = [
            "🚂", "🚃", "🚄", "🚅", "🚆", "🚇", "🚈", "🚉", "🚊", "🚝",
            "🚞", "🚋", "🚌", "🚍", "🚎", "🚐", "🚑", "🚒", "🚓", "🚔",
            "🚕", "🚖", "🚗", "🚘", "🚙", "🚚", "🚛", "🚜", "🏎️",
            "🏍️", "🛵", "🚲", "🛴", "🛹", "🚏",
            "🛣️", "🛤️", "🛢️", "⛽", "🚨", "🚥", "🚦", "🛑", "🚧",

        ]
        
        public static let all: [Character] = [
            "🚂", "🚃", "🚄", "🚅", "🚆", "🚇", "🚈", "🚉", "🚊", "🚝",
            "🚞", "🚋", "🚌", "🚍", "🚎", "🚐", "🚑", "🚒", "🚓", "🚔",
            "🚕", "🚖", "🚗", "🚘", "🚙", "🛻", "🚚", "🚛", "🚜", "🏎️",
            "🏍️", "🛵", "🦽", "🦼", "🛺", "🚲", "🛴", "🛹", "🛼", "🚏",
            "🛣️", "🛤️", "🛢️", "⛽", "🛞", "🚨", "🚥", "🚦", "🛑", "🚧",

        ]
    }

    public enum TransportWater {
        public static let basic: [Character] = [
            "⚓", "⛵", "🛶", "🚤", "🛳️", "⛴️", "🛥️", "🚢",
        ]
        
        public static let all: [Character] = [
            "⚓", "🛟", "⛵", "🛶", "🚤", "🛳️", "⛴️", "🛥️", "🚢",
        ]
    }

    public enum TransportAir {
        public static let basic: [Character] = [
            "✈️", "🛩️", "🛫", "🛬", "💺", "🚁", "🚟", "🚠", "🚡",
            "🛰️", "🚀", "🛸",
        ]
        
        public static let all: [Character] = [
            "✈️", "🛩️", "🛫", "🛬", "🪂", "💺", "🚁", "🚟", "🚠", "🚡",
            "🛰️", "🚀", "🛸",
        ]
    }

    public enum Hotel {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🛎️", "🧳",
        ]
    }

    public enum Time {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "⌛", "⏳", "⌚", "⏰", "⏱️", "⏲️", "🕰️", "🕛", "🕧", "🕐",
            "🕜", "🕑", "🕝", "🕒", "🕞", "🕓", "🕟", "🕔", "🕠", "🕕",
            "🕡", "🕖", "🕢", "🕗", "🕣", "🕘", "🕤", "🕙", "🕥", "🕚",
            "🕦",
        ]
    }

    public enum SkyAndWeather {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🌑", "🌒", "🌓", "🌔", "🌕", "🌖", "🌗", "🌘", "🌙", "🌚",
            "🌛", "🌜", "🌡️", "☀️", "🌝", "🌞", "🪐", "⭐", "🌟", "🌠",
            "🌌", "☁️", "⛅", "⛈️", "🌤️", "🌥️", "🌦️", "🌧️", "🌨️", "🌩️",
            "🌪️", "🌫️", "🌬️", "🌀", "🌈", "🌂", "☂️", "☔", "⛱️", "⚡",
            "❄️", "☃️", "⛄", "☄️", "🔥", "💧", "🌊",
        ]
    }
}
