extension EmojiList.Classic.AnimalsAndNature {
    public enum AnimalMammal {
        public static let basic: [Character] = [
            "🐵", "🐒", "🦍", "🐶", "🐕", "🐩", "🐺",
            "🦊", "🦝", "🐱", "🐈", "🦁", "🐯", "🐅", "🐆", "🐴",
            "🐎", "🦄", "🦓", "🦌", "🐮", "🐂", "🐃",
            "🐄", "🐷", "🐖", "🐗", "🐽", "🐏", "🐑", "🐐", "🐪", "🐫",
            "🦙", "🦒", "🐘", "🦏", "🦛", "🐭", "🐁", "🐀", "🐹",
            "🐰", "🐇", "🐿️", "🦔", "🦇", "🐻", "🐨", "🐼",
            "🦘", "🦡", "🐾",
        ]
        
        public static let all: [Character] = [
            "🐵", "🐒", "🦍", "🦧", "🐶", "🐕", "🦮", "🐕‍🦺", "🐩", "🐺",
            "🦊", "🦝", "🐱", "🐈", "🐈‍⬛", "🦁", "🐯", "🐅", "🐆", "🐴",
            "🫎", "🫏", "🐎", "🦄", "🦓", "🦌", "🦬", "🐮", "🐂", "🐃",
            "🐄", "🐷", "🐖", "🐗", "🐽", "🐏", "🐑", "🐐", "🐪", "🐫",
            "🦙", "🦒", "🐘", "🦣", "🦏", "🦛", "🐭", "🐁", "🐀", "🐹",
            "🐰", "🐇", "🐿️", "🦫", "🦔", "🦇", "🐻", "🐻‍❄️", "🐨", "🐼",
            "🦥", "🦦", "🦨", "🦘", "🦡", "🐾",
        ]
    }

    public enum AnimalBird {
        public static let basic: [Character] = [
            "🦃", "🐔", "🐓", "🐣", "🐤", "🐥", "🐦", "🐧", "🕊️", "🦅",
            "🦆", "🦢", "🦉", "🦚", "🦜",
        ]
        
        public static let all: [Character] = [
            "🦃", "🐔", "🐓", "🐣", "🐤", "🐥", "🐦", "🐧", "🕊️", "🦅",
            "🦆", "🦢", "🦉", "🦤", "🪶", "🦩", "🦚", "🦜", "🪽", "🐦‍⬛",
            "🪿", "🐦‍🔥",
        ]
    }

    public enum AnimalAmphibian {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🐸",
        ]
    }

    public enum AnimalReptile {
        public static let basic: [Character] = all
        
        public static let all: [Character] = [
            "🐊", "🐢", "🦎", "🐍", "🐲", "🐉", "🦕", "🦖",
        ]
    }

    public enum AnimalMarine {
        public static let basic: [Character] = [
            "🐳", "🐋", "🐬", "🐟", "🐠", "🐡", "🦈", "🐙", "🐚",
            "🦀", "🦞", "🦐", "🦑",
        ]
        
        public static let all: [Character] = [
            "🐳", "🐋", "🐬", "🦭", "🐟", "🐠", "🐡", "🦈", "🐙", "🐚",
            "🪸", "🪼", "🦀", "🦞", "🦐", "🦑", "🦪",
        ]
    }

    public enum AnimalBug {
        public static let basic: [Character] = [
            "🐌", "🦋", "🐛", "🐜", "🐝", "🐞", "🦗", "🕷️",
            "🕸️", "🦂", "🦟", "🦠",
        ]
        
        public static let all: [Character] = [
           "🐌", "🦋", "🐛", "🐜", "🐝", "🪲", "🐞", "🦗", "🪳", "🕷️",
            "🕸️", "🦂", "🦟", "🪰", "🪱", "🦠",
        ]
    }

    public enum PlantFlower {
        public static let basic: [Character] = [
            "💐", "🌸", "💮", "🏵️", "🌹", "🥀", "🌺", "🌻", "🌼",
            "🌷",
        ]
        
        public static let all: [Character] = [
            "💐", "🌸", "💮", "🏵️", "🌹", "🥀", "🌺", "🌻", "🌼",
            "🌷",
        ]
    }

    public enum PlantOther {
        public static let basic: [Character] = [
            "🌱", "🌲", "🌳", "🌴", "🌵", "🌾", "🌿", "☘️", "🍀",
            "🍁", "🍂", "🍃", "🍄",
        ]
        
        public static let all: [Character] = [
           "🌱", "🪴", "🌲", "🌳", "🌴", "🌵", "🌾", "🌿", "☘️", "🍀",
            "🍁", "🍂", "🍃", "🪹", "🪺", "🍄", "🪾",
        ]
    }
}
